# frozen_string_literal: true

class ReplaceCharacter
  include Interactor
  
  def call
    str = context.input
    return if str.blank?

    map = [
      ["9AD9", ["9AD8"]], # 髙 => 高
      ["20BB7", ["5409"]], # 𠮷 => 吉
      ["2460", ["FF11"]], # ① => １
      ["2461", ["FF12"]], # ② => ２
      ["2462", ["FF13"]], # ③ => ３
      ["2463", ["FF14"]], # ④ => ４
      ["2464", ["FF15"]], # ⑤ => ５
      ["2465", ["FF16"]], # ⑥ => ６
      ["2466", ["FF17"]], # ⑦ => ７
      ["2467", ["FF18"]], # ⑧ => ８
      ["2468", ["FF19"]], # ⑨ => ９
      ["2469", ["FF11","FF10"]], # ⑩ => １０
      ["246A", ["FF11","FF11"]], # ⑪ => １１
      ["246B", ["FF11","FF12"]], # ⑫ => １２
      ["246C", ["FF11","FF13"]], # ⑬ => １３
      ["246D", ["FF11","FF14"]], # ⑭ => １４
      ["246E", ["FF11","FF15"]], # ⑮ => １５
      ["246F", ["FF11","FF16"]], # ⑯ => １６
      ["2470", ["FF11","FF17"]], # ⑰ => １７
      ["2471", ["FF11","FF18"]], # ⑱ => １８
      ["2472", ["FF11","FF19"]], # ⑲ => １９
      ["2473", ["FF12","FF10"]], # ⑳ => ２０
      ["3231", ["FF08","682A","FF09"]], # ㈱ =>（株）
      ["2160", ["FF29"]], # Ⅰ => Ｉ
      ["2161", ["FF29","FF29"]], # Ⅱ => ＩＩ
      ["2162", ["FF29","FF29","FF29"]], # Ⅲ => ＩＩＩ
      ["2163", ["FF29","FF36"]], # Ⅳ => ＩＶ
      ["2164", ["FF36"]], # Ⅴ => Ｖ
      ["2165", ["FF36","FF29"]], # Ⅵ => ＶＩ
      ["2166", ["FF36","FF29","FF29"]], # Ⅶ => ＶＩＩ
      ["2167", ["FF36","FF29","FF29","FF29"]], # Ⅷ => ＶＩＩＩ
      ["2168", ["FF29","FF38"]], # Ⅸ => ＩＸ
      ["2169", ["FF38"]], # Ⅹ => Ｘ
      ["FF5E", ["301C"]], # wave-dash
      ["FF0D", ["30FC"]], # full-width minus
      ["FFE0", ["00A2"]], # cent sign
      ["FFE1", ["00A3"]], # pound sign
      ["FFE2", ["00AC"]], # not sign
      ["2015", ["2014"]], # full-width dash
      ["2225", ["2016"]], # double vertical line
    ]

    context.output = map.inject(str) do |s, (before, after)| s.gsub(
      before.to_i(16).chr(Encoding::UTF_8),
      after.map{ |s| s.to_i(16).chr(Encoding::UTF_8) }.join)
    end
  end
end
